Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[1469    4]
 [  62 1418]]
Classification Report
              precision    recall  f1-score   support

       Alive       0.96      1.00      0.98      1473
    Silicone       1.00      0.96      0.98      1480

    accuracy                           0.98      2953
   macro avg       0.98      0.98      0.98      2953
weighted avg       0.98      0.98      0.98      2953

