Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_4 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_5 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[903  97]
 [ 46 954]]
Classification Report
              precision    recall  f1-score   support

        Live       0.95      0.90      0.93      1000
       Spoof       0.91      0.95      0.93      1000

    accuracy                           0.93      2000
   macro avg       0.93      0.93      0.93      2000
weighted avg       0.93      0.93      0.93      2000

