Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[1082  168]
 [ 249  746]]
Classification Report
              precision    recall  f1-score   support

        Live       0.81      0.87      0.84      1250
       Spoof       0.82      0.75      0.78       995

    accuracy                           0.81      2245
   macro avg       0.81      0.81      0.81      2245
weighted avg       0.81      0.81      0.81      2245

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[1047  203]
 [ 181  814]]
Classification Report
              precision    recall  f1-score   support

        Live       0.85      0.84      0.85      1250
       Spoof       0.80      0.82      0.81       995

    accuracy                           0.83      2245
   macro avg       0.83      0.83      0.83      2245
weighted avg       0.83      0.83      0.83      2245

