Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[ 968   27]
 [ 462 1032]]
Classification Report
              precision    recall  f1-score   support

        Live       0.68      0.97      0.80       995
       Spoof       0.97      0.69      0.81      1494

    accuracy                           0.80      2489
   macro avg       0.83      0.83      0.80      2489
weighted avg       0.86      0.80      0.80      2489

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[ 975   20]
 [ 258 1236]]
Classification Report
              precision    recall  f1-score   support

        Live       0.79      0.98      0.88       995
       Spoof       0.98      0.83      0.90      1494

    accuracy                           0.89      2489
   macro avg       0.89      0.90      0.89      2489
weighted avg       0.91      0.89      0.89      2489

