Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 112, 112, 32)      320       
_________________________________________________________________
activation_19 (Activation)   (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 110, 110, 32)      9248      
_________________________________________________________________
activation_20 (Activation)   (None, 110, 110, 32)      0         
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 55, 55, 32)        0         
_________________________________________________________________
dropout_10 (Dropout)         (None, 55, 55, 32)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 55, 55, 64)        18496     
_________________________________________________________________
activation_21 (Activation)   (None, 55, 55, 64)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 53, 53, 64)        36928     
_________________________________________________________________
activation_22 (Activation)   (None, 53, 53, 64)        0         
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 26, 26, 64)        0         
_________________________________________________________________
dropout_11 (Dropout)         (None, 26, 26, 64)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 43264)             0         
_________________________________________________________________
dense_7 (Dense)              (None, 512)               22151680  
_________________________________________________________________
activation_23 (Activation)   (None, 512)               0         
_________________________________________________________________
dropout_12 (Dropout)         (None, 512)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 513       
_________________________________________________________________
activation_24 (Activation)   (None, 1)                 0         
=================================================================
Total params: 22,217,185
Trainable params: 22,217,185
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[654 346]
 [  9 991]]
Classification Report
              precision    recall  f1-score   support

        Live       0.99      0.65      0.79      1000
       Spoof       0.74      0.99      0.85      1000

    accuracy                           0.82      2000
   macro avg       0.86      0.82      0.82      2000
weighted avg       0.86      0.82      0.82      2000

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[972  28]
 [234 766]]
Classification Report
              precision    recall  f1-score   support

        Live       0.81      0.97      0.88      1000
       Spoof       0.96      0.77      0.85      1000

    accuracy                           0.87      2000
   macro avg       0.89      0.87      0.87      2000
weighted avg       0.89      0.87      0.87      2000

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[975  25]
 [104 896]]
Classification Report
              precision    recall  f1-score   support

        Live       0.90      0.97      0.94      1000
       Spoof       0.97      0.90      0.93      1000

    accuracy                           0.94      2000
   macro avg       0.94      0.94      0.94      2000
weighted avg       0.94      0.94      0.94      2000

Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_1 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_2 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[998   2]
 [164 836]]
Classification Report
              precision    recall  f1-score   support

        Live       0.86      1.00      0.92      1000
       Spoof       1.00      0.84      0.91      1000

    accuracy                           0.92      2000
   macro avg       0.93      0.92      0.92      2000
weighted avg       0.93      0.92      0.92      2000

Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 110, 110, 32)      320       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 108, 108, 32)      9248      
_________________________________________________________________
dropout_4 (Dropout)          (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 106, 106, 64)      18496     
_________________________________________________________________
dropout_5 (Dropout)          (None, 106, 106, 64)      0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 104, 104, 128)     73856     
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 102, 102, 128)     147584    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 51, 51, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 332928)            0         
_________________________________________________________________
dense_3 (Dense)              (None, 256)               85229824  
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 257       
=================================================================
Total params: 85,479,585
Trainable params: 85,479,585
Non-trainable params: 0
_________________________________________________________________
Confusion Matrix
[[995   5]
 [ 96 904]]
Classification Report
              precision    recall  f1-score   support

        Live       0.91      0.99      0.95      1000
       Spoof       0.99      0.90      0.95      1000

    accuracy                           0.95      2000
   macro avg       0.95      0.95      0.95      2000
weighted avg       0.95      0.95      0.95      2000

